+++
date = "2017-09-17T07:00:00"
title = "我是《看不見的客人》的導演，解釋下電影裏出現的  Bug"
titleimage = "https://pic2.zhimg.com/v2-7f41fd9b4ed66395a9e25cf753d076fd.jpg"
ga = 091707
+++

<div class="main-wrap content-wrap">
<div class="headline">

<div class="img-place-holder"></div>



</div>

<div class="content-inner">




<div class="question">
<h2 class="question-title">在《看不見的客人》這一電影中的短信是 bug 嗎?</h2>

<div class="answer">



<div class="content">
<p>中文由我的中國同事幫忙整理翻譯，謝謝他們。</p>
<p>關於短信 bug 的解釋，首先，定時短信的設置在整個情節中非常重要，並不像大家覺得這是一個 bug。</p>
<p>只有當艾德里安進入了房間以後看到這條短信，纔會讓他覺得這是一個圈套，如果沒有短信，光憑口述是無法讓這麼一個聰明的人發現這是一個圈套，所以他纔會做出相應的反映</p>
<p>其次是短信定時，在最後一次反轉，我們知道短信是勞拉通過定時發送的。中國觀衆會覺得這種行爲有點扯，但短信定時發送在西班牙是一件非常常見的事，尤其是像酒店預定等一些服務，是有定時推送短信這項服務功能的，而且非常嚴格，這點符合邏輯的。</p>
<p>爲什麼能夠確保艾德里安進入房間後，纔會看到這個短信。因爲在酒店選址上，我選擇了一個非常遙遠的山邊的酒店，只有火車才能抵達，但火車是有時刻表的，也就是說，火車的時刻表可以作爲整個影片時間的邏輯線，火車時間表讓勞拉非常清楚的知道哪一班火車什麼時間到達，因此短信到達會很準確。</p>
<p>最後一點想說的是，在最後一個反轉劇情中，勞拉是策劃者，她把艾德里安叫到房間，然後告訴他：我已經把所有真相，告訴丹尼爾的父母了，咱們應該去自首。如果她想做到這件事，一定是經過精心安排設計的，因爲她知道艾德里安很聰明，她不會出現在這種環節的失誤，不會說因爲一個短信而在邏輯上出現錯誤。最後再一次強調，這個短信非常重要，因爲短信讓他們知道這是一個圈套。</p>
<p>En cuanto al bug (&ldquo;error&rdquo;) del mansaje, yo creo lo contrario a la mayor&iacute;a del p&uacute;blico. En primer lugar, el situar el mensaje a una determinada hora juega un papel muy importante en toda la trama del film. Ya que Adri&aacute;n no puede descubrir la trampa hasta entrar en la habitaci&oacute;n y despu&eacute;s leer el mensaje. Si no hubiese esto, con solo hablar no podr&iacute;a sentirse enga&ntilde;ado aunque es un hombre inteligente, y por eso reacciona de manera adecuada. Por otro lado, el situar el mensaje en un momento determinado. Cuando sucede el &uacute;ltimo viraje, Laura hace que el mensaje se env&iacute;e en un determinado tiempo. Quiz&aacute; parte de la audiencia china lo crea un acto exc&eacute;ntrico, pero el hecho de mandar el mensaje en un determindo tiempo es muy com&uacute;n en Espa&ntilde;a. Como, por ejemplo, en algunos hoteles que prestan el servicio de enviar mensajes a determinadas horas, y de manera estricta. Eso no es inusual. &iquest;C&oacute;mo asegurar que Adri&aacute;n lee este mismo mensaje luego de la entra en la habitaci&oacute;n? Por la raz&oacute;n de que hemos elegido un hotel remoto, situado junto a las monta&ntilde;as, al que s&oacute;lo puede llegar en tren. Aqu&iacute; queda lo m&aacute;s importante - hay que tener en cuenta el horario del tren - el horario sirve como la l&iacute;nea l&oacute;gica en el film. Con la ayuda del horario, Laura sabe claramente cu&aacute;ndo va a llegar cada tren, por tanto, el mensaje es puntual. Lo &uacute;ltimo que quiero decir es que, en el &uacute;ltimo viraje, Laura es la que fragua todo. Llama a Adri&aacute;n a su habitaci&oacute;n para decirle que ya les ha contado toda la verdad a los padres de Daniel y que deben denunciarse. Si lo quiere conseguir, ser&aacute; todo bien estructurado y dise&ntilde;ado, porque conoce bien a Adri&aacute;n que es un hombre astuto. Ella no puede permitirse a s&iacute; misma cometer un error en el punto del mensaje, un error il&oacute;gico. Quiero destacar, de nuevo, que este mensaje es un elemento significante por lo que hace que ellos sepan que eso es una trampa.</p>
</div>
</div>




</div>


</div>
</div>